src/InformationRegisters/ПротоколОперацийУправленияСеансами/ПротоколОперацийУправленияСеансами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПротоколОперацийУправленияСеансами</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Успешно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательСеанса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазыКластера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кластер</name>
    <type>
      <types>CatalogRef.КластерыСерверов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>EnumRef.ОперацииУправленияСеансами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ОперацииУправленияСеансами/ОперацииУправленияСеансами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацииУправленияСеансами</name>
  <enumValues>
    <name>ЗавершениеСеанса</name>
  </enumValues>
  <enumValues>
    <name>ПакетноеЗавершениеСеансов</name>
  </enumValues>
  <enumValues>
    <name>УстановкаБлокировки</name>
  </enumValues>
  <enumValues>
    <name>СнятиеБлокировки</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеНастроекАдминистрирования</name>
  </enumValues>
  <enumValues>
    <name>ОтказВДоступе</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаАдминистрирования</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/ПротоколУправленияСеансами/Module.bsl
#Область ПрограммныйИнтерфейс

// Пишет операцию в журнал регистрации и регистр протокола.
//
// Параметры:
//  Операция - ПеречислениеСсылка.ОперацииУправленияСеансами
//  ИнформационнаяБаза - СправочникСсылка.ИнформационныеБазыКластера
//  Описание - Строка
//  ДанныеСеанса - Структура:
//   * Номер - Число
//   * Пользователь - Строка
//                 - Неопределено
//  Успешно - Булево
//  Кластер - СправочникСсылка.КластерыСерверов
//
Процедура ЗаписатьОперацию(Операция, ИнформационнаяБаза, Описание, ДанныеСеанса = Неопределено, Успешно = Истина, Кластер = Неопределено) Экспорт
	Уровень = ?(Успешно, УровеньЖурналаРегистрации.Информация, УровеньЖурналаРегистрации.Предупреждение);
	ЗаписатьСобытие(Операция, ИнформационнаяБаза, Кластер, Описание, Описание, Уровень, Успешно, ДанныеСеанса);
КонецПроцедуры

// Пишет ошибку администрирования в журнал регистрации и регистр протокола.
//
// Параметры:
//  Операция - ПеречислениеСсылка.ОперацииУправленияСеансами
//  ИнформационнаяБаза - СправочникСсылка.ИнформационныеБазыКластера
//  ИнформацияОбОшибке - ИнформацияОбОшибке
//  ДанныеСеанса - Структура:
//   * Номер - Число
//   * Пользователь - Строка
//                 - Неопределено
//  Кластер - СправочникСсылка.КластерыСерверов
//
Процедура ЗаписатьОшибку(Операция, ИнформационнаяБаза, ИнформацияОбОшибке, ДанныеСеанса = Неопределено, Кластер = Неопределено) Экспорт
	КраткоеОписание = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	ПодробноеОписание = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	ЗаписатьСобытие(Операция, ИнформационнаяБаза, Кластер, КраткоеОписание, ПодробноеОписание,
		УровеньЖурналаРегистрации.Ошибка, Ложь, ДанныеСеанса);
КонецПроцедуры

// Пишет отказ в доступе в журнал регистрации и регистр протокола.
//
// Параметры:
//  ИнформационнаяБаза - СправочникСсылка.ИнформационныеБазыКластера
//  Описание - Строка
//
Процедура ЗаписатьОтказВДоступе(ИнформационнаяБаза, Описание) Экспорт
	ЗаписатьСобытие(Перечисления.ОперацииУправленияСеансами.ОтказВДоступе,
		ИнформационнаяБаза, Неопределено, Описание, Описание,
		УровеньЖурналаРегистрации.Предупреждение, Ложь, Неопределено);
КонецПроцедуры
// Удаляет записи протокола старше срока хранения.
// Если константа СрокХраненияПротоколаОперацийДней равна 0, записи не удаляются.
//
Процедура ОчиститьУстаревшиеЗаписи() Экспорт
	СрокХраненияДней = Константы.СрокХраненияПротоколаОперацийДней.Получить();
	Если СрокХраненияДней <= 0 Тогда
		Возврат;
	КонецЕсли;
	
	Граница = НачалоДня(ТекущаяДатаСеанса()) - СрокХраненияДней * 86400;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Протокол.Период КАК Период,
		|	Протокол.Пользователь КАК Пользователь,
		|	Протокол.ИнформационнаяБаза КАК ИнформационнаяБаза,
		|	Протокол.Кластер КАК Кластер,
		|	Протокол.Операция КАК Операция,
		|	Протокол.ИдентификаторСобытия КАК ИдентификаторСобытия
		|ИЗ
		|	РегистрСведений.ПротоколОперацийУправленияСеансами КАК Протокол
		|ГДЕ
		|	Протокол.Период < &Граница";
	Запрос.УстановитьПараметр("Граница", Граница);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.ПротоколОперацийУправленияСеансами.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Удалить();
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьСобытие(Операция, ИнформационнаяБаза, Кластер, ОписаниеРегистра, КомментарийЖурнала, Уровень, Успешно, ДанныеСеанса)
	КластерЗаписи = КластерОперации(ИнформационнаяБаза, Кластер);
	ДанныеОбъекта = ДанныеОбъектаЖурнала(ИнформационнаяБаза, КластерЗаписи);
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытияЖурнала(Операция),
		Уровень,
		ДанныеОбъекта.Метаданные,
		ДанныеОбъекта.Данные,
		КомментарийЖурнала);
	
	ЗаписатьВРегистр(Операция, ИнформационнаяБаза, КластерЗаписи, ОписаниеРегистра, Успешно, ДанныеСеанса);
КонецПроцедуры

Процедура ЗаписатьВРегистр(Операция, ИнформационнаяБаза, Кластер, Описание, Успешно, ДанныеСеанса)
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		ЗначенияЗаписи = Новый Структура;
		ЗначенияЗаписи.Вставить("Период", ТекущаяДатаСеанса());
		ЗначенияЗаписи.Вставить("Пользователь", Пользователи.ТекущийПользователь());
		ЗначенияЗаписи.Вставить("ИнформационнаяБаза", ИнформационнаяБаза);
		ЗначенияЗаписи.Вставить("Кластер", Кластер);
		ЗначенияЗаписи.Вставить("Операция", Операция);
		ЗначенияЗаписи.Вставить("ИдентификаторСобытия", Новый УникальныйИдентификатор);
		ЗначенияЗаписи.Вставить("Успешно", Успешно);
		ЗначенияЗаписи.Вставить("Описание", Описание);
		ЗаполнитьДанныеСеанса(ЗначенияЗаписи, ДанныеСеанса);
		
		Запись = РегистрыСведений.ПротоколОперацийУправленияСеансами.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, ЗначенияЗаписи);
		Запись.Записать();
	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Управление сеансами.Ошибка записи протокола'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры
Процедура ЗаполнитьДанныеСеанса(ЗначенияЗаписи, ДанныеСеанса)
	Если ДанныеСеанса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеСеанса.Свойство("Номер") Тогда
		ЗначенияЗаписи.Вставить("НомерСеанса", ДанныеСеанса.Номер);
	КонецЕсли;
	
	Если ДанныеСеанса.Свойство("Пользователь") Тогда
		ЗначенияЗаписи.Вставить("ПользовательСеанса", ДанныеСеанса.Пользователь);
	КонецЕсли;
КонецПроцедуры
Функция КластерОперации(ИнформационнаяБаза, Кластер)
	Если ЗначениеЗаполнено(Кластер) Тогда
		Возврат Кластер;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИнформационнаяБаза) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИнформационнаяБаза, "Владелец");
КонецФункции
Функция ДанныеОбъектаЖурнала(ИнформационнаяБаза, Кластер)
	Результат = Новый Структура("Метаданные, Данные");
	Если ЗначениеЗаполнено(ИнформационнаяБаза) Тогда
		Результат.Метаданные = Метаданные.Справочники.ИнформационныеБазыКластера;
		Результат.Данные = ИнформационнаяБаза;
	ИначеЕсли ЗначениеЗаполнено(Кластер) Тогда
		Результат.Метаданные = Метаданные.Справочники.КластерыСерверов;
		Результат.Данные = Кластер;
	Иначе
		Результат.Метаданные = Метаданные.РегистрыСведений.ПротоколОперацийУправленияСеансами;
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция ИмяСобытияЖурнала(Операция)
	КодЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	Если Операция = Перечисления.ОперацииУправленияСеансами.ЗавершениеСеанса Тогда
		Возврат НСтр("ru = 'Управление сеансами.Завершение сеанса'", КодЯзыка);
	ИначеЕсли Операция = Перечисления.ОперацииУправленияСеансами.ПакетноеЗавершениеСеансов Тогда
		Возврат НСтр("ru = 'Управление сеансами.Пакетное завершение сеансов'", КодЯзыка);
	ИначеЕсли Операция = Перечисления.ОперацииУправленияСеансами.УстановкаБлокировки Тогда
		Возврат НСтр("ru = 'Управление сеансами.Установка блокировки'", КодЯзыка);
	ИначеЕсли Операция = Перечисления.ОперацииУправленияСеансами.СнятиеБлокировки Тогда
		Возврат НСтр("ru = 'Управление сеансами.Снятие блокировки'", КодЯзыка);
	ИначеЕсли Операция = Перечисления.ОперацииУправленияСеансами.ИзменениеНастроекАдминистрирования Тогда
		Возврат НСтр("ru = 'Управление сеансами.Изменение настроек администрирования'", КодЯзыка);
	ИначеЕсли Операция = Перечисления.ОперацииУправленияСеансами.ОтказВДоступе Тогда
		Возврат НСтр("ru = 'Управление сеансами.Отказ в доступе'", КодЯзыка);
	ИначеЕсли Операция = Перечисления.ОперацииУправленияСеансами.ОшибкаАдминистрирования Тогда
		Возврат НСтр("ru = 'Управление сеансами.Ошибка администрирования'", КодЯзыка);
	КонецЕсли;
	
	Возврат НСтр("ru = 'Управление сеансами'", КодЯзыка);
КонецФункции

#КонецОбласти
